src/toir_cfe/src/Reports/проф_ПланФактВыполненияРемонтовПодрядчиками/проф_ПланФактВыполненияРемонтовПодрядчиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>проф_ПланФактВыполненияРемонтовПодрядчиками</name>
</mdclass:Report>

src/toir_cfe/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8fbeca-59ee-4207-b4da-c1fdb926cf07">
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ca7de41a-4380-42d3-b93b-3d14a13ce3d9">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a534769e-5beb-4b57-b3af-d138e38afe8e">
    <name>ЕстьЗаявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e320ae57-9da9-47dd-9d22-4265d1574beb">
    <name>ЕстьНаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="26632482-bdd2-4881-af87-d856096d8d30">
    <name>ЕстьАкт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d55a38b3-ccd6-42d5-ae8f-6fe7a5e3b7e3">
    <name>ЕстьАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f7d027da-099e-47c1-b6c6-76397094ed0e">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="646d6d26-3edf-4e80-88ae-f94e1a83e51d">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="760d81bf-833c-42a4-8d1e-f2df012d64e5">
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="ba85eb5c-9b6e-4b48-91c7-27de33dd2f16">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="088d9db2-1a15-4bff-99d4-26bc08da07cd">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8d7e3dc7-96eb-4e67-9634-d1e75420b4bb">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="60e67476-1608-4996-b48f-ffa74f993732">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="332898fd-fb46-4e34-af0e-1450d855fac1">
    <name>ПодразделениеИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="442326ff-0b99-4a6d-81af-fa819b4a7b89">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="09bf821b-96d8-44ff-a873-1aa963572a34">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="72058171-1407-4dd6-aab0-0f72afd60d2a">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="168c85e9-3bb0-431a-ae6e-08c455b37fa5">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="9f5d4e4f-bee5-4929-ac3d-e4200cf1416f">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6306ae3-4e8a-4225-8afa-a01e16f34954">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="85c92d14-1c04-44bd-9284-befe63c7394c">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="605b0bf5-59d2-473b-b6f9-85ceca4cd110">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Enums/торо_ВидыДокументовНачалаЦепочкиРемонтов/торо_ВидыДокументовНачалаЦепочкиРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9a4a271c-3df6-45ca-a18a-c3a215a23313">
  <name>торо_ВидыДокументовНачалаЦепочкиРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="567a12d3-c608-43f0-a336-d5f773d2a52a">
    <name>ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="71d3ac2c-00e7-4f96-8907-382131bb091a">
    <name>ВыявленныйДефект</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="567318ad-fa36-4a40-8027-655e8c8f1c0b">
    <name>ПланГрафикППР</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dddfb2af-bfea-4ecb-bce9-f89ad241fcdb">
    <name>ГрафикРегламентныхМероприятий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5fbd54c9-ad4a-4147-8009-4ee5b1befa8f">
  <name>СпособыСтроительства</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0558d129-3d89-4535-b823-e42b39e1c5c6">
    <name>Подрядный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="43d08372-f824-466a-b828-f37e49508b58">
    <name>Хозспособ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_АктОВыполненииРегламентногоМероприятия/торо_АктОВыполненииРегламентногоМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0d268f7b-1710-4fd8-afa5-3c3c3a4f6c20">
  <name>торо_АктОВыполненииРегламентногоМероприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="3c57ab81-c51b-4e13-84ea-d58d8f701578">
    <name>Мероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="324c1a20-7a19-4b19-a64e-bd0f6652f799">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="71909b36-38e5-4d41-9803-7860ed2b377d">
  <name>торо_ПланГрафикРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7e9515d4-1e0b-402a-8a9b-c6a04c349bc7">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="caabbdda-e895-4d1f-939f-3da6bbc4ef8a">
    <name>ПланРемонтов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="33a739f5-f146-4490-87df-57785546d548">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Reports/проф_ПланФактВыполненияРемонтовПодрядчиками/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
//++ Проф-ИТ, #126, Соловьев А.А., 28.12.2023

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТекИерархия = торо_ОтчетыСервер.ПолучитьЗначениеСтруктурыИерархии(КомпоновщикНастроек);
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "КонецПериода");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ID КАК ID,
		|	Данные.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		|	Данные.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
		|	Данные.ДатаНачалаФакт КАК ДатаНачалаФакт,
		|	Данные.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
		|	Данные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	Данные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	Данные.Исполнитель КАК Исполнитель,
		|	Данные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	Данные.Акт КАК Акт,
		|	Данные.СтатусРаботыПодрядчика КАК СтатусРаботыПодрядчика,
		|	Данные.РемонтЗавершен КАК РемонтЗавершен,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии,
		|	ЕСТЬNULL(втПлан.Сумма, 0) КАК СуммаПлановая,
		|	ЕСТЬNULL(втФакт.Сумма, 0) КАК СуммаФактическая,
		|	ЕСТЬNULL(втФакт.Сумма, 0) - ЕСТЬNULL(втПлан.Сумма, 0) КАК ОтклонениеСумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втПлан.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(втФакт.Сумма, 0) / втПлан.Сумма * 100
		|	КОНЕЦ КАК ОтклонениеПроцент,
		|	втПлан.НаправлениеДеятельности КАК НаправлениеДеятельностиПлан,
		|	втФакт.НаправлениеДеятельности КАК НаправлениеДеятельностиФакт
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО Данные.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПлан КАК втПлан
		|		ПО Данные.ДокументНачалаЦепочки = втПлан.Ссылка
		|			И Данные.ID = втПлан.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ втФакт КАК втФакт
		|		ПО Данные.Акт = втФакт.Ссылка
		|			И Данные.ID = втФакт.ID";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);
		
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ID КАК ID,
		|	Данные.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		|	Данные.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
		|	Данные.ДатаНачалаФакт КАК ДатаНачалаФакт,
		|	Данные.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
		|	Данные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	Данные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	Данные.Исполнитель КАК Исполнитель,
		|	Данные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	Данные.Акт КАК Акт,
		|	Данные.СтатусРаботыПодрядчика КАК СтатусРаботыПодрядчика,
		|	Данные.РемонтЗавершен КАК РемонтЗавершен,
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии,
		|	ЕСТЬNULL(втПлан.Сумма, 0) КАК СуммаПлановая,
		|	ЕСТЬNULL(втФакт.Сумма, 0) КАК СуммаФактическая,
		|	ЕСТЬNULL(втФакт.Сумма, 0) - ЕСТЬNULL(втПлан.Сумма, 0) КАК ОтклонениеСумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втПлан.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(втФакт.Сумма, 0) / втПлан.Сумма * 100
		|	КОНЕЦ КАК ОтклонениеПроцент,
		|	втПлан.НаправлениеДеятельности КАК НаправлениеДеятельностиПлан,
		|	втФакт.НаправлениеДеятельности КАК НаправлениеДеятельностиФакт
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО Данные.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПлан КАК втПлан
		|		ПО Данные.ДокументНачалаЦепочки = втПлан.Ссылка
		|			И Данные.ID = втПлан.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ втФакт КАК втФакт
		|		ПО Данные.Акт = втФакт.Ссылка
		|			И Данные.ID = втФакт.ID";
		
	КонецЕсли;
	
	//ПолеРесурса = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	//ПолеРесурса.Выражение   = "СУММА(СуммаПлановая)";
	//ПолеРесурса.ПутьКДанным = "СуммаПлановая";
	//
	//ПолеРесурса = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	//ПолеРесурса.Выражение   = "СУММА(СуммаФактическая)";
	//ПолеРесурса.ПутьКДанным = "СуммаФактическая";
	//
	//ПолеРесурса = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	//ПолеРесурса.Выражение   = "СУММА(ОтклонениеСумма)";
	//ПолеРесурса.ПутьКДанным = "ОтклонениеСумма";
	//
	//ПолеРесурса = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	//ПолеРесурса.Выражение   = "СУММА(ОтклонениеПроцент)";
	//ПолеРесурса.ПутьКДанным = "ОтклонениеПроцент";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = ЗагрузитьНастройкиПриИзмененииПараметров();

КонецПроцедуры

Функция ЗагрузитьНастройкиПриИзмененииПараметров()  
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ИерархияТип"));	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбщиеДанныеПоРемонтам.IDРемонта КАК IDРемонта,
	|	ЕСТЬNULL(торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта, торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта) КАК ОбъектРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ВидРемонта КАК ВидРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.Завершен КАК РемонтЗавершен,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачалаРемонтныхРабот,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончанияРемонтныхРабот,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов КАК СписокОбъектов
	|ПОМЕСТИТЬ ВТ_Ремонты
	|ИЗ
	|	РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВыявленныйДефект)
	|				ТОГДА &ПоказыватьДефекты = ИСТИНА
	|			КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВнешнееОснованиеДляРабот)
	|				ТОГДА &ПоказыватьВнешниеОснования = ИСТИНА
	|			КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ПланГрафикППР)
	|				ТОГДА &ПоказыватьППР = ИСТИНА
	|			КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ГрафикРегламентныхМероприятий)
	|				ТОГДА &ПоказыватьРМ = ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ торо_ОбщиеДанныеПоРемонтам.Отменен
	|	И НЕ торо_ОбщиеДанныеПоРемонтам.Замещен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Ремонты.IDРемонта КАК IDРемонта,
	|	ВТ_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Ремонты.ВидРемонта КАК ВидРемонта,
	|	ВТ_Ремонты.РемонтЗавершен КАК РемонтЗавершен,
	|	ВТ_Ремонты.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	ВТ_Ремонты.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	ВТ_Ремонты.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	торо_ПлановыеИсполнителиРемонтов.Исполнитель КАК Исполнитель,
	|	ВТ_Ремонты.СписокОбъектов КАК СписокОбъектов
	|ПОМЕСТИТЬ ВТ_План
	|ИЗ
	|	ВТ_Ремонты КАК ВТ_Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеИсполнителиРемонтов КАК торо_ПлановыеИсполнителиРемонтов
	|		ПО ВТ_Ремонты.IDРемонта = торо_ПлановыеИсполнителиРемонтов.IDРемонта
	|ГДЕ
	|	торо_ПлановыеИсполнителиРемонтов.СпособВыполнения = ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_Ремонты.IDРемонта КАК IDРемонта,
	|	ВТ_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Ремонты.ВидРемонта КАК ВидРемонта,
	|	ВТ_Ремонты.РемонтЗавершен КАК РемонтЗавершен,
	|	ВТ_Ремонты.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	ВТ_Ремонты.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	ВТ_Ремонты.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_Ремонты.СписокОбъектов КАК СписокОбъектов,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала КАК ДатаНачалаФакт,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончанияФакт,
	|	торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Ссылка КАК Акт,
	|	торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	ВТ_Ремонты КАК ВТ_Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам
	|		ПО ВТ_Ремонты.IDРемонта = торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Исполнитель ССЫЛКА Справочник.Контрагенты)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|		ПО ВТ_Ремонты.IDРемонта = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Ремонты.IDРемонта,
	|	ВТ_Ремонты.ОбъектРемонта,
	|	ВТ_Ремонты.ВидРемонта,
	|	ВТ_Ремонты.РемонтЗавершен,
	|	ВТ_Ремонты.ДатаНачалаРемонтныхРабот,
	|	ВТ_Ремонты.ДатаОкончанияРемонтныхРабот,
	|	ВТ_Ремонты.ДокументНачалаЦепочки,
	|	ВТ_Ремонты.СписокОбъектов,
	|	торо_АктОВыполненииЭтапаРаботМероприятия.ДатаНачала,
	|	торо_АктОВыполненииЭтапаРаботМероприятия.ДатаОкончания,
	|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка,
	|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Контрагент
	|ИЗ
	|	ВТ_Ремонты КАК ВТ_Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.ПодрядчикиРемонтныхРабот КАК торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот
	|		ПО ВТ_Ремонты.IDРемонта = торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.РемонтыОборудования_ID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииЭтапаРаботМероприятия
	|		ПО ВТ_Ремонты.IDРемонта = торо_АктОВыполненииЭтапаРаботМероприятия.ID
	|ГДЕ
	|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОбщиеДанныеПоРемонтам.IDРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ВидРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.Завершен,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
	|	торо_ОбщиеДанныеПоРемонтам.ДокументНачалаЦепочки,
	|	NULL,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания,
	|	торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Исполнитель
	|ИЗ
	|	РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = ВТ_Ремонты.IDРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Исполнитель ССЫЛКА Справочник.Контрагенты)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|			И (ВЫБОР
	|				КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВыявленныйДефект)
	|					ТОГДА &ПоказыватьДефекты = ИСТИНА
	|				КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВнешнееОснованиеДляРабот)
	|					ТОГДА &ПоказыватьВнешниеОснования = ИСТИНА
	|				КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ПланГрафикППР)
	|					ТОГДА &ПоказыватьППР = ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	ВТ_Ремонты.IDРемонта ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОбщиеДанныеПоРемонтам.IDРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ВидРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.Завершен,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
	|	торо_ОбщиеДанныеПоРемонтам.ДокументНачалаЦепочки,
	|	NULL,
	|	торо_АктОВыполненииЭтапаРаботМероприятия.ДатаНачала,
	|	торо_АктОВыполненииЭтапаРаботМероприятия.ДатаОкончания,
	|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка,
	|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Контрагент
	|ИЗ
	|	РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = ВТ_Ремонты.IDРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.ПодрядчикиРемонтныхРабот КАК торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыполненныеМероприятияОбъектов КАК торо_ВыполненныеМероприятияОбъектов
	|			ПО торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.РемонтыОборудования_ID = торо_ВыполненныеМероприятияОбъектов.ID
	|				И торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка = торо_ВыполненныеМероприятияОбъектов.Регистратор
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.РемонтыОборудования_ID
	|			И (&ПоказыватьРМ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииЭтапаРаботМероприятия
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктОВыполненииЭтапаРаботМероприятия.ID
	|ГДЕ
	|	ВТ_Ремонты.IDРемонта ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ_План.IDРемонта, ВТ_Факт.IDРемонта) КАК ID,
	|	ЕСТЬNULL(ВТ_План.ДатаНачалаРемонтныхРабот, ВТ_Факт.ДатаНачалаРемонтныхРабот) КАК ДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(ВТ_План.ДатаОкончанияРемонтныхРабот, ВТ_Факт.ДатаОкончанияРемонтныхРабот) КАК ДатаОкончанияРемонтныхРабот,
	|	ВТ_Факт.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	ВТ_Факт.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	ЕСТЬNULL(ВТ_План.ОбъектРемонта, ВТ_Факт.ОбъектРемонта) КАК ОбъектРемонтныхРабот,
	|	ЕСТЬNULL(ВТ_План.ВидРемонта, ВТ_Факт.ВидРемонта) КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(ВТ_Факт.Исполнитель, ВТ_План.Исполнитель) КАК Исполнитель,
	|	ЕСТЬNULL(ВТ_План.ДокументНачалаЦепочки, ВТ_Факт.ДокументНачалаЦепочки) КАК ДокументНачалаЦепочки,
	|	ВТ_Факт.Акт КАК Акт,
	|	ВЫБОР
	|		КОГДА ВТ_План.IDРемонта ЕСТЬ NULL
	|			ТОГДА ""Привлечение данного подрядчика не планировалась""
	|		КОГДА ВТ_Факт.IDРемонта ЕСТЬ NULL
	|				И НЕ ВТ_План.Исполнитель В (ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|			ТОГДА ""Подрядчик не выполнил работы""
	|		КОГДА ВТ_Факт.IDРемонта ЕСТЬ NULL
	|			ТОГДА ""Подрядчик не выбран""
	|		КОГДА НЕ ВТ_Факт.IDРемонта ЕСТЬ NULL
	|				И НЕ ВТ_План.IDРемонта ЕСТЬ NULL
	|				И ВТ_План.Исполнитель В (ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|			ТОГДА ""Привлечение данного подрядчика не планировалась""
	|		ИНАЧЕ ""Плановое выполнение работ подрядчиком""
	|	КОНЕЦ КАК СтатусРаботыПодрядчика,
	|	ЕСТЬNULL(ВТ_План.СписокОбъектов, ВТ_Факт.СписокОбъектов) КАК СписокОбъектов,
	|	ЕСТЬNULL(ВТ_План.РемонтЗавершен, ВТ_Факт.РемонтЗавершен) КАК РемонтЗавершен
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ВТ_План КАК ВТ_План
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	|		ПО ВТ_План.IDРемонта = ВТ_Факт.IDРемонта
	|			И (ВТ_План.Исполнитель = ВТ_Факт.Исполнитель
	|				ИЛИ ВТ_План.Исполнитель В (ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
	|{ГДЕ
	|	(ВТ_Факт.ДатаНачалаФакт <= &КонецПериода
	|			ИЛИ ВТ_План.ДатаНачалаРемонтныхРабот <= &КонецПериода) КАК Поле2,
	|	(ВТ_Факт.ДатаОкончанияФакт >= &НачалоПериода
	|			ИЛИ ВТ_План.ДатаОкончанияРемонтныхРабот >= &НачалоПериода) КАК Поле4}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонтаПланРемонтов.Ссылка КАК Ссылка,
	|	торо_ПланГрафикРемонта.проф_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СУММА(торо_ПланГрафикРемонтаПланРемонтов.СуммаРемонта) КАК Сумма,
	|	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID
	|ПОМЕСТИТЬ втПлан
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	|		ПО торо_ПланГрафикРемонта.Ссылка = торо_ПланГрафикРемонтаПланРемонтов.Ссылка
	|ГДЕ
	|	торо_ПланГрафикРемонтаПланРемонтов.Ссылка В
	|			(ВЫБРАТЬ
	|				Данные.ДокументНачалаЦепочки
	|			ИЗ
	|				Данные КАК Данные)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПланГрафикРемонтаПланРемонтов.Ссылка,
	|	торо_ПланГрафикРемонта.проф_НаправлениеДеятельности,
	|	торо_ПланГрафикРемонтаПланРемонтов.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРабот.Ссылка КАК Ссылка,
	|	СУММА(торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Сумма) КАК Сумма,
	|	торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.РемонтыОборудования_ID КАК ID
	|ПОМЕСТИТЬ втФактПредв
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам
	|		ПО торо_АктОВыполненииЭтапаРабот.Ссылка = торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.Ссылка
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРабот.Ссылка В
	|			(ВЫБРАТЬ
	|				Данные.Акт
	|			ИЗ
	|				Данные КАК Данные)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_АктОВыполненииЭтапаРабот.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботИсполнителиПоРемонтам.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втФактПредв.Ссылка КАК Ссылка,
	|	МАКСИМУМ(торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование) КАК ДокументОснование
	|ПОМЕСТИТЬ втДокументОснованиеАкта
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования,
	|	втФактПредв КАК втФактПредв
	|
	|СГРУППИРОВАТЬ ПО
	|	втФактПредв.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументОснованиеАкта.Ссылка КАК Ссылка,
	|	торо_ЗаявкаНаРемонт.проф_НаправлениеДеятельности КАК проф_НаправлениеДеятельности
	|ПОМЕСТИТЬ втНаправленияДеятельностиФакт
	|ИЗ
	|	втДокументОснованиеАкта КАК втДокументОснованиеАкта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|		ПО втДокументОснованиеАкта.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втФактПредв.Ссылка КАК Ссылка,
	|	СУММА(втФактПредв.Сумма) КАК Сумма,
	|	втФактПредв.ID КАК ID,
	|	МАКСИМУМ(ЕСТЬNULL(втНаправленияДеятельностиФакт.проф_НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.проф_НаправленияДеятельности.ПустаяСсылка))) КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ втФакт
	|ИЗ
	|	втФактПредв КАК втФактПредв
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНаправленияДеятельностиФакт КАК втНаправленияДеятельностиФакт
	|		ПО втФактПредв.Ссылка = втНаправленияДеятельностиФакт.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втФактПредв.Ссылка,
	|	втФактПредв.ID"
	
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции

//-- Проф-ИТ, #126, Соловьев А.А., 28.12.2023
#КонецОбласти

#КонецЕсли
